## 20. 시계열 데이터, 월별 집계, 인덱스

In [36]:
import pandas as pd

df = pd.read_csv("data/type1_data1.csv")
df.head()

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

1. 연도 구분 없이 월별로 숫자형 컬럼의 합을 구하시오.
2. 합계 중 'views'가 가장 작은 값을 가진 월을 정수로 구하시오

In [37]:
df['subscribed'] = pd.to_datetime(df['subscribed'])
df['month'] =df['subscribed'].dt.month
df=df.groupby('month').sum(numeric_only=True)
df.sort_values(['views'], ascending=False).index[0]

2